adpyke.vscode-sql-formatter
azemoh.one-monokai
bajdzis.vscode-database
bierner.markdown-mermaid
bradymholt.pgformatter
ckolkman.vscode-postgres
dcasella.monokai-plusplus
donjayamanne.githistory
dracula-theme.theme-dracula
enkia.tokyo-night
esbenp.prettier-vscode
gerane.theme-flatlandmonokai
golang.go
grapecity.gc-excelviewer
hashicorp.terraform
karunamurti.haml
mechatroner.rainbow-csv
mgmcdermott.vscode-language-babel
mikestead.dotenv
ms-dotnettools.csharp
ms-dotnettools.vscode-dotnet-runtime
ms-python.isort
ms-python.python
ms-python.vscode-pylance
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode-remote.vscode-remote-extensionpack
ms-vscode.remote-explorer
ms-vscode.remote-server
pascalreitermann93.vscode-yaml-sort
shopify.ruby-lsp
tamasfe.even-better-toml
waderyan.gitblame
zhuangtongfa.material-theme
